Pivot Tables

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    973     94   John  January      Q1
1  2023-01-02       B   West    289     89   Mary  January      Q1
2  2023-01-03       C  North    580     89    Bob  January      Q1
3  2023-01-04       D  South    347     59  Alice  January      Q1
4  2023-01-05       A   East    725     48   John  January      Q1
5  2023-01-06       B   West    868     46   Mary  January      Q1
6  2023-01-07       C  North    937     17    Bob  January      Q1
7  2023-01-08       D  South    367     86  Alice  January      Q1
8  2023-01-09       A   East    324     50   John  January      Q1
9  2023-01-10       B   West    415     37   Mary  January      Q1
10 2023-01-11       C  North    749     44    Bob  January      Q1
11 2023-01-12       D  South    145     64  Alice  January      Q1
12 2023-01-13       A   East    605     56   John  January      Q1
13 2023-01-14       B   West    723     20   Mary  January      Q1
14 2023-01-15       C  North    967     16    Bob  January      Q1
15 2023-01-16       D  South    649     97  Alice  January      Q1
16 2023-01-17       A   East    936     62   John  January      Q1
17 2023-01-18       B   West    667     98   Mary  January      Q1
18 2023-01-19       C  North    609     71    Bob  January      Q1
19 2023-01-20       D  South    633     86  Alice  January      Q1

In [6]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc='median')

Product      A      B      C      D
Region
East     725.0    NaN    NaN    NaN
North      NaN    NaN  749.0    NaN
South      NaN    NaN    NaN  367.0
West       NaN  667.0    NaN    NaN

In [9]:
pivot=pd.pivot_table(df, values=['Sales','Units'], index='Region', columns='Product')
pivot

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     712.6    NaN    NaN    NaN  62.0   NaN   NaN   NaN
North      NaN    NaN  768.4    NaN   NaN   NaN  47.4   NaN
South      NaN    NaN    NaN  428.2   NaN   NaN   NaN  78.4
West       NaN  592.4    NaN    NaN   NaN  58.0   NaN   NaN

cross tabs